<?php
/*
Да се състави програма, чрез която се извежда квадрат от
цифри. Сумите от елементите на произволен ред или стълб са
равни на 45.
Изход:
1 2 3 4 5 6 7 8 9 0
2 3 4 5 6 7 8 9 0 1
3 4 5 6 7 8 9 0 1 2
4 5 6 7 8 9 0 1 2 3
5 6 7 8 9 0 1 2 3 4
6 7 8 9 0 1 2 3 4 5
7 8 9 0 1 2 3 4 5 6
8 9 0 1 2 3 4 5 6 7
9 0 1 2 3 4 5 6 7 8
0 1 2 3 4 5 6 7 8 9
 */
for ($row=0; $row<=9; $row++) {
    for ($column=0; $column<=9; $column++) {
        
        if ($row + $column >= 10) {
            echo $row + $column - 9;
        } 
        else {
            if ($row + $column + 1 == 10){
                echo "0";
            }
            else {
                echo $row + $column + 1;
            }

        }
    }
    echo "\n";
}
