<?php
/*
 Да се въведе число, след което да се създаде масив с 10
елемента по следния начин:
Първите 2 елемента на масива са въведеното число.
Всеки следващ елемент на масива е равен на сбора от
предишните 2 елемента в масива.
След това изведете масива .
Въведете число: 1
1 1 2 3 5 8 13 21 34 55
 */
echo "Please enter a number: ";
$num = intval(trim(fgets(STDIN)));
$result = [$num, $num];
for ($i = 2; $i < 10; $i++){
    $result[$i] = $result[$i - 1] + $result[$i - 2];
}
foreach ($result as $item) {
    echo $item . " ";
}