<?php
/*
 Да се състави програма, чрез която предварително въведени 10
реални числа от интервала се обработват по следния начин:
1. Извежда съществуващите числа.
2. Всички елементи със стойност по-малки от -0.231 се заменят със
сумата от квадрата на индекса им + числото 41.25, а всички останали
елементи се заменят с произведението между самия елемент и
неговият пореден номер
3. Да се изведат елементите от началния и новообразувания масив.
4. Да се изведат средната стойност на всички елементи от новата
редица, които са различни от 0.
Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25
 */
$original = [-1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4];
$copy = $original;
for ($i = 0; $i < count($copy); $i++){
    if ($copy[$i] < -0.231){
        $copy[$i] = ($i+1) * ($i+1) + 41.25;
    }
    else{
        $copy[$i] *= $i+1;
    }
}
$average = array_sum($copy) / 10;

echo implode(',', $original).PHP_EOL;
echo implode(',', $copy).PHP_EOL;
echo "The average is " . $average;