<?php
/*
 Имате предварително въведени стойности на елементи в двумерен
масив - естествени числа.
Да се състави програма, чрез която се извеждат стойностите на
елементите в двумерен масив след обръщането му на +90 градуса.
Пример:
1,2,3,4
5,6,7,8
9,10,11,12
13,14,15,16
Изход
13,9,5,1
14,10,6,2
15,11,7,3
16,12,8,4
 */
$input = [
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12],
    [13,14,15,16]
];
$rows = count($input);
$cols = count($input[0]);
$mat90 = [];

for ($i = 0; $i < $cols; $i++) {
    for ($j = 0; $j < $rows; $j++) {
        $mat90[$rows - $i - 1][$j] = $input[$rows - $j - 1][$i];
    }
}
for ($i = count($mat90) - 1; $i >= 0; $i--){
    echo implode(',', $mat90[$i]).PHP_EOL;
}